<!-- $Id$ -->

<!-- ********************auxiliar******************** -->

<!-- $Id$ -->
<Chapter Label="Auxiliar">
<Heading>Useful properties and functions</Heading>

<Section Label="AuxiliarProperties">
<Heading>Semisimple group algebras of finite groups</Heading>

<ManSection>
   <Prop Name="IsZeroCharacteristicGroupAlgebra" 
         Arg="KG"  
         Comm="Is a group algebra of a finite group over the field of char zero?" />
   <Description>
         Returns <E>true</E> if <M>KG</M> is the group algebra of a finite 
         group over the field of characteristic zero, and <E>false</E> if 
         <M>KG</M> is another kind of a group ring.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> G:=DihedralGroup(128);
<pc group of size 128 with 7 generators>
gap> QG:=GroupRing( Rationals, G);
<algebra-with-one over Rationals, with 7 generators>
gap> CG := GroupRing( GaussianRationals, G);
<algebra-with-one over GaussianRationals, with 7 generators>
gap> F2G := GroupRing( GF(2), G);
<algebra-with-one over GF(2), with 7 generators>
gap> IsZeroCharacteristicGroupAlgebra(QG);
true
gap> IsZeroCharacteristicGroupAlgebra(CG);
true
gap> IsZeroCharacteristicGroupAlgebra(F2G);
false
]]>
</Example>


<ManSection>
   <Prop Name="IsSemisimpleRationalGroupAlgebra" 
         Arg="KG"  
         Comm="Is rational group algebra of finite group?" />
   <Description>
         Returns <E>true</E> if <M>KG</M> is the rational group algebra of a finite 
         group and <E>false</E> if it is another kind of group ring.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> G:=DihedralGroup(128);
<pc group of size 128 with 7 generators>
gap> QG:=GroupRing( Rationals, G);
<algebra-with-one over Rationals, with 7 generators>
gap> CG := GroupRing( GaussianRationals, G);
<algebra-with-one over GaussianRationals, with 7 generators>
gap> F3G := GroupRing( GF(3), G);
<algebra-with-one over GF(3), with 7 generators>
gap> IsSemisimpleRationalGroupAlgebra(QG);
true
gap> IsSemisimpleRationalGroupAlgebra(CG);
false
gap> IsSemisimpleRationalGroupAlgebra(F3G);
false
]]>
</Example>


<ManSection>
   <Prop Name="IsSemisimpleFiniteGroupAlgebra" 
         Arg="KG"  
         Comm="Is a group algebra of a finite group over a finite field?" />
   <Description>
         Returns <E>true</E> if <M>KG</M> is a semisimple finite group algebra, 
         that is a group algebra of a finite group <M>G</M> with coefficients on 
         a field of order coprime with the order of <M>G</M>, and <E>false</E> 
         if it is another type of group ring.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> G:=DihedralGroup(128);
<pc group of size 128 with 7 generators>
gap> QG:=GroupRing( Rationals, G);
<algebra-with-one over Rationals, with 7 generators>
gap> F2G := GroupRing( GF(2), G);
<algebra-with-one over GF(2), with 7 generators>
gap> F3G := GroupRing( GF(3), G);
<algebra-with-one over GF(3), with 7 generators>
gap> IsSemisimpleFiniteGroupAlgebra(F2G);
false
gap> IsSemisimpleFiniteGroupAlgebra(F3G);
true
gap> IsSemisimpleFiniteGroupAlgebra(FG);
true
gap> IsSemisimpleFiniteGroupAlgebra(QG);
false
]]>
</Example>


</Section>


<Section Label="AuxiliarOperations">
<Heading>Operations over group rings elements</Heading>


<ManSection>
   <Oper Name="Centralizer" 
         Arg="G a"  
         Comm="Centralizer on a subgroup of a group ring element in " />
   <Returns>
         a subgroup of a group <M>G</M>.
   </Returns>         
   <Description>
         Returns the centralizer of an element <M>a</M> of a group ring <M>FH</M> 
         in a subgroup <M>G</M> of the underlying group <M>H</M> of <M>FH</M>.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> G:=SymmetricGroup(5);
Sym( [ 1 .. 5 ] )
gap> K:=Group([(1,2,3,4)]);
Group([ (1,2,3,4) ])
gap> H:=Group( () );
Group(())
gap> QG:=GroupRing(Rationals,G);
<algebra-with-one over Rationals, with 2 generators>
gap> e:=IdempotentBySubgroups(QG,K,H);
(1/2)*()+(-1/2)*(1,3)(2,4)
gap> S4:=SymmetricGroup(4);
Sym( [ 1 .. 4 ] )
gap> Centralizer(S4,e);
Group([ (2,4), (1,2)(3,4) ])
]]>
</Example>


<ManSection>
   <Oper Name="OnPoints" 
         Arg="x g"  
         Comm="Conjugate of x by g" />
   <Oper Name="\^" 
         Arg="x g"  
         Comm="Conjugate of x by g" />
   <Returns>
         an element of a group ring
   </Returns>         
   <Description>
         Returns the conjugate <M>a^g = g^{-1} a g</M> of <M>a</M> by <M>g</M>
         where <M>a</M> is an element of a group ring <M>FG</M> and <M>g</M> is an 
         element of the underlying group <M>G</M>. <P/>
                  
         <E>a^g</E> produces the same output.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> G:=AlternatingGroup(5); QG:=GroupRing(Rationals,G);
Alt( [ 1 .. 5 ] )
<algebra-with-one over Rationals, with 2 generators>
gap> a:=Random(QG);
(-1/2)*()+(1)*(3,4,5)+(1)*(3,5,4)+(1)*(2,3)(4,5)+(-1/5)*(2,3,4)+(-2)*(2,3,5)+(
1/2)*(2,4,3)+(2)*(2,4,5)+(-3/2)*(2,4)(3,5)+(1)*(2,5,4)+(1/5)*(2,5)(3,4)+(1/2)*
(1,2)(4,5)+(3)*(1,2)(3,4)+(-4)*(1,2)(3,5)+(1)*(1,2,3)+(3)*(1,2,3,4,5)+(1)*
(1,2,3,5,4)+(-1/3)*(1,2,4,5,3)+(3)*(1,2,4)+(-1)*(1,2,4,3,5)+(-2)*(1,2,5)+(1/
2)*(1,2,5,3,4)+(-2)*(1,3,2)+(-3/2)*(1,3,4,5,2)+(1)*(1,3,5,4,2)+(-1/2)*(1,3)
(4,5)+(1/5)*(1,3,4)+(1)*(1,3,5)+(1/3)*(1,3)(2,4)+(5/6)*(1,3,2,4,5)+(2)*
(1,3,5,2,4)+(1/2)*(1,3)(2,5)+(1/3)*(1,3,2,5,4)+(-1/2)*(1,3,4,2,5)+(3/2)*
(1,4,2)+(2)*(1,4,3,5,2)+(-3)*(1,4,3)+(2)*(1,4,5)+(-1)*(1,4,5,2,3)+(-1)*(1,4)
(2,3)+(2/5)*(1,4,2,3,5)+(1)*(1,4,2,5,3)+(-2)*(1,4,3,2,5)+(1/3)*(1,4)(2,5)+(1/
4)*(1,5,2)+(1/3)*(1,5,3,4,2)+(-1/2)*(1,5,3)+(-3/2)*(1,5,4)+(1)*(1,5)(3,4)+(5)*
(1,5,4,2,3)+(1/2)*(1,5)(2,3)+(-1)*(1,5,2,4,3)+(1/2)*(1,5,3,2,4)+(1)*(1,5)(2,4)
gap> a^(1,2,3);
(-1/2)*()+(2)*(3,4,5)+(1)*(3,5,4)+(1/2)*(2,3)(4,5)+(3)*(2,3,4)+(-2)*(2,3,5)+(
3/2)*(2,4,3)+(2)*(2,4,5)+(1/3)*(2,4)(3,5)+(1/4)*(2,5,3)+(-3/2)*(2,5,4)+(1)*
(2,5)(3,4)+(-1/2)*(1,2)(4,5)+(1/3)*(1,2)(3,4)+(1/2)*(1,2)(3,5)+(1)*(1,2,3)+(
-1/3)*(1,2,3,4,5)+(-1)*(1,2,4,5,3)+(-3)*(1,2,4)+(1)*(1,2,4,3,5)+(5)*
(1,2,5,4,3)+(-1/2)*(1,2,5)+(-1)*(1,2,5,3,4)+(-2)*(1,3,2)+(5/6)*(1,3,4,5,2)+(1/
3)*(1,3,5,4,2)+(1)*(1,3)(4,5)+(1/2)*(1,3,4)+(-1)*(1,3)(2,4)+(-2)*(1,3,5,2,4)+(
1/2)*(1,3)(2,5)+(1/2)*(1,3,4,2,5)+(-3/2)*(1,4,5,3,2)+(1/5)*(1,4,2)+(-1/2)*
(1,4,3,5,2)+(-1/5)*(1,4,3)+(1)*(1,4,5)+(1/5)*(1,4)(3,5)+(3)*(1,4,5,2,3)+(3)*
(1,4)(2,3)+(1/2)*(1,4,2,3,5)+(1/3)*(1,4,3,2,5)+(1)*(1,4)(2,5)+(1)*
(1,5,4,3,2)+(1)*(1,5,2)+(2)*(1,5,3,4,2)+(-2)*(1,5,3)+(1)*(1,5,4)+(-3/2)*(1,5)
(3,4)+(1)*(1,5,4,2,3)+(-4)*(1,5)(2,3)+(-1)*(1,5,2,3,4)+(2/5)*(1,5,2,4,3)+(2)*
(1,5,3,2,4)
gap> OnPoints(a,(1,2)(3,4));
(-1/2)*()+(1)*(3,4,5)+(1)*(3,5,4)+(-3)*(2,3,4)+(2)*(2,3,5)+(1/5)*(2,4,3)+(1)*
(2,4,5)+(-1/2)*(2,4)(3,5)+(-3/2)*(2,5,3)+(-1/2)*(2,5,4)+(1)*(2,5)(3,4)+(-4)*
(1,2)(4,5)+(3)*(1,2)(3,4)+(1/2)*(1,2)(3,5)+(3/2)*(1,2,3)+(2)*(1,2,3,4,5)+(1)*
(1,2,4,5,3)+(-2)*(1,2,4)+(-3/2)*(1,2,4,3,5)+(1/3)*(1,2,5,4,3)+(1/4)*(1,2,5)+(
3)*(1,3,2)+(-1)*(1,3,4,5,2)+(-1/3)*(1,3,5,4,2)+(-3/2)*(1,3)(4,5)+(1/2)*
(1,3,4)+(2)*(1,3,5)+(1/3)*(1,3)(2,4)+(2)*(1,3,2,4,5)+(5/6)*(1,3,5,2,4)+(1)*
(1,3)(2,5)+(1/2)*(1,3,2,5,4)+(-1)*(1,3,4,2,5)+(1)*(1,4,5,3,2)+(1)*(1,4,2)+(3)*
(1,4,3,5,2)+(-1/5)*(1,4,3)+(-2)*(1,4,5)+(1)*(1,4)(3,5)+(2/5)*(1,4,5,2,3)+(-1)*
(1,4)(2,3)+(-1)*(1,4,2,3,5)+(5)*(1,4,2,5,3)+(1/2)*(1,4)(2,5)+(1/2)*
(1,5,4,3,2)+(-2)*(1,5,2)+(1)*(1,5,3)+(1/5)*(1,5)(3,4)+(1)*(1,5,4,2,3)+(1/3)*
(1,5)(2,3)+(-2)*(1,5,2,3,4)+(-1/2)*(1,5,2,4,3)+(1/3)*(1,5,3,2,4)+(1/2)*(1,5)
(2,4)
]]>
</Example>


<ManSection>
   <Oper Name="AverageSum" 
         Arg="FG X"  
         Comm="Sum X/Order X" />
   <Returns>
         an element of a group ring
   </Returns>         
   <Description>
         Returns the element of the group algebra <M>FG</M> obtaining summing
         up the elements of <M>X</M> divided by the order of <M>X</M>, where
         <M>X</M> is a finite subset of the underlying group <M>G</M> of 
         <M>FG</M> whose order is not multiple of the characteristic of the field <M>F</M>.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> G:=DihedralGroup(24);
<pc group of size 24 with 4 generators>
gap> H:=Subgroup(G,[Random(G),Random(G)]);
Group([ f1*f4, f4 ])
gap> QG:=GroupRing(Rationals,G);
<algebra-with-one over Rationals, with 4 generators>
gap> FG:=GroupRing( CF(5), G);
<algebra-with-one over CF(5), with 4 generators>
gap> AverageSum( QG, H);
(1/6)*<identity> of ...+(1/6)*f1+(1/6)*f4+(1/6)*f1*f4+(1/6)*f4^2+(1/6)*f1*f4^2
gap> AverageSum( FG, H);
(1/6)*<identity> of ...+(1/6)*f1+(1/6)*f4+(1/6)*f1*f4+(1/6)*f4^2+(1/6)*f1*f4^2
]]>
</Example>

</Section>


<Section Label="CC">
<Heading>Cyclotomic classes</Heading>

<ManSection>
   <Oper Name="CyclotomicClasses" 
         Arg="q n"  
         Comm="Cyclotomic classes" />
   <Returns>
         a partition of [ 0 .. n ]
   </Returns>          
   <Description>
         Returns the <M>q</M>-cyclotomic classes module <M>n</M>, where <M>q</M>
         and <M>n</M> are relatively prime positive integers. <Ref Sect="CyclotomicClass" />
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> CyclotomicClasses(2,21);
[ [ 0 ], [ 1, 2, 4, 8, 16, 11 ], [ 3, 6, 12 ], [ 5, 10, 20, 19, 17, 13 ],
  [ 7, 14 ], [ 9, 18, 15 ] ]
gap> CyclotomicClasses(10,21);
[ [ 0 ], [ 1, 10, 16, 13, 4, 19 ], [ 2, 20, 11, 5, 8, 17 ],
  [ 3, 9, 6, 18, 12, 15 ], [ 7 ], [ 14 ] ]
]]>
</Example>


<ManSection>
   <Oper Name="IsCyclotomicClass" 
         Arg="q n C"  
         Comm="Is Cyclotomic class" />
   <Returns>
         Boolean
   </Returns>          
   <Description>
      Returns <E>true</E> if <M>C</M> is a <M>q</M>-cyclotomic class module <M>n</M> and
      <E>false</E> otherwise, 
      for <M>q</M> and <M>n</M> relatively prime integers and <M>C</M> a subset of [0 .. n].
      <Ref Sect="CyclotomicClass" />.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> IsCyclotomicClass(2,7,[1,2,4]);
true
gap> IsCyclotomicClass(2,21,[1,2,4]);
false
gap> IsCyclotomicClass(2,21,[3,6,12]);
true
]]>
</Example>


</Section>

</Chapter>