<!-- $Id$ -->

<!-- ********************Decomp******************** -->

<Chapter Label="Decomp">
<Heading>Wedderburn decomposition</Heading>

<Section Label="DecompDecomp">
<Heading>Wedderburn decomposition</Heading>

<ManSection>
   <Attr Name="WedderburnDecomposition" 
         Arg="FG"  
         Comm="The Wedderburn decomposition of a group algebras given as a list 
         of GAP objects" />
   <Returns>
         a list of simple algebras
   </Returns>
   <Description>
         The input <A>FG</A> should be a group algebra of a finite group <M>G</M> 
         over the field <M>F</M>, where <M>F</M> is either the field 
         of characteristic zero or a finite field of characteristic coprime 
         with the order of <M>G</M>. <P/> 
         
         In the case of characteristic zero,
         the function returns the list of all <E>Wedderburn components</E>
         (<Ref Sect="WedDec" />) of the group algebra <A>FG</A>. <P/> 
         
         In the case of non-zero characteristic, it returns a list of
         Wedderburn components of <A>FG</A> realizable by strongly Shoda pairs 
         (see <Ref Sect="SSPDef" />) of the group <M>G</M>. If not all 
         Wedderburn components of <A>FG</A> can be realizable by strongly
         Shoda pairs, a warning will be displayed. 
         For many groups <M>G</M> every Wedderburn component of <A>FG</A> 
         is realizable by a strongly Shoda pair and then the direct product of 
         the entries of the output is isomorphic to <A>FG</A>. 
         For example this is the case if <M>G</M> is abelian-by-supersolvable 
         <Cite Key="ORS" />. 
   </Description>
</ManSection>


<Example>
<![CDATA[
gap> WedderburnDecomposition( GroupRing( GF(5), DihedralGroup(16) ) );
[ GF(5), GF(5), GF(5), GF(5), ( GF(5)^[ 2, 2 ] ), ( GF(5^2)^[ 2, 2 ] ) ] # OLD
gap>  WedderburnDecomposition( GroupRing( GF(5), DihedralGroup(16) ) );
[ ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 1, 1 ] ), 
  ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 2, 2 ] ), ( GF(5^2)^[ 2, 2 ] ) ] # NEW!!!
]]>
</Example>

The previous example shows that the Wedderburn decomposition of the group 
algebra <M>GF(5) D_{16}</M> of the dihedral group of order <M>16</M> over the 
field of order <M>5</M> is 
<M>4 GF(5) \oplus M_2(GF(5)) \oplus M_2(GF(25))</M>. <P/>

Next example shows the Wedderburn decomposition of the rational group algebra of 
the symmetric group on <M>4</M> letters.

<Example>
<![CDATA[
gap> WedderburnDecomposition( GroupRing( Rationals, SymmetricGroup(4) ) );    
[ Rationals, Rationals, ( Rationals^[ 3, 3 ] ), ( Rationals^[ 3, 3 ] ), 
  <crossed product over CF(3), with 2 generators and center=Rationals> ]
]]>
</Example>

If not all the Wedderburn components of the input are realizable by strongly 
Shoda pairs, a warning message is displayed together with the output, like 
in the following example for the smallest group with a monomial but non-strongly
monomial irreducible character:

<Example>
<![CDATA[
gap> WedderburnDecomposition( GroupRing( GF(5), SmallGroup(48,28) ) );
[ ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 2, 2 ] ), 
  ( GF(5^2)^[ 2, 2 ] ), ( GF(5)^[ 3, 3 ] ), ( GF(5)^[ 3, 3 ] ), 
  ( GF(5)^[ 4, 4 ] ) ] # NEW!!!
]]>
</Example>

Nevertheless, we are able to give the full Wedderburn decomposition for group algebras of the same group in characteristic zero, for example:

<Example>
<![CDATA[
gap> WedderburnDecomposition( GroupRing( Rationals, SmallGroup(48,28) ) );
[ Rationals, Rationals, ( Rationals^[ 3, 3 ] ), ( Rationals^[ 3, 3 ] ), 
  <crossed product over CF(3), with 2 generators and center=Rationals>, 
  <crossed product over AsField( NF(8,[ 1, 7 ]), CF(8) ), with 
    2 generators and center=NF(8,[ 1, 7 ])>, 
  ( <crossed product over CF(3), with 2 generators and center=Rationals>^
    [ 1, 1 ] ) ] # OLD!!!
gap> WedderburnDecomposition( GroupRing( Rationals, SmallGroup(48,28) ) );
[ Rationals, Rationals, ( Rationals^[ 3, 3 ] ), ( Rationals^[ 3, 3 ] ), 
  <crossed product over CF(3), with 2 generators and center=Rationals>, 
  <crossed product over AsField( NF(8,[ 1, 7 ]), CF(8) ), with 
    2 generators and center=NF(8,[ 1, 7 ])>, 
  ( <crossed product over CF(3), with 2 generators and center=Rationals>^
    [ 2, 2 ] ) ] # NEW !!!
gap> WedderburnDecomposition( GroupRing( CF(3), SmallGroup(48,28) ) );
[ CF(3), CF(3), ( CF(3)^[ 3, 3 ] ), ( CF(3)^[ 3, 3 ] ), ( CF(3)^[ 2, 2 ] ), 
  <crossed product over AsField( NF(24,[ 1, 7 ]), CF(24) ), 
    with 2 generators and center=NF(24,[ 1, 7 ])>, ( CF(3)^[ 4, 4 ] ) ]
]]>
</Example>



<!-- ************************ -->

<ManSection>
   <Attr Name="WedderburnDecompositionInfo" 
         Arg="FG"  
         Comm="The Wedderburn decomposition of a group algebras given as a list of lists of numerical data 
         describing each Wedderburn component" />
   <Returns>
         a list of numerical descriptions of simple algebras
   </Returns>
   <Description>
         This function is a counterpart of <Ref Attr="WedderburnDecomposition" />
         which uses the same group algebra <A>FG</A> as an input and 
         computes some numerical data describing the Wedderburn components 
         (see <Ref Sect="WedDec" />) of the group algebra <A>FG</A> with the 
         same limitations in the case of non-zero characteristic as in 
         <Ref Attr="WedderburnDecomposition" />.
         See <Ref Sect="SSPDef" /> for further interpretation of the output.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> F:=FreeGroup("a","b");;a:=F.1;;b:=F.2;;rel:=[a^8,a^4*b^2,b^-1*a*b*a];;
gap> Q16:=F/rel;; QQ16:=GroupRing( Rationals, Q16 );;
gap> QS4:=GroupRing( Rationals, SymmetricGroup(4) );;
gap> WedderburnDecomposition(QQ16);
[ Rationals, Rationals, Rationals, Rationals, ( Rationals^[ 2, 2 ] ), 
  <crossed product over AsField( NF(8,[ 1, 7 ]), CF(8) ), with 2 generators 
    and center=NF(8,[ 1, 7 ])> ]
gap> WedderburnDecomposition( QS4 );  
[ Rationals, Rationals, ( Rationals^[ 3, 3 ] ), ( Rationals^[ 3, 3 ] ), 
  <crossed product over CF(3), with 2 generators and center=Rationals> ]
gap> WedderburnDecompositionInfo(QQ16);
[ [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ], 
  [ 2, Rationals ], [ 1, NF(8,[ 1, 7 ]), 8, [ 2, 7, 4 ] ] ]
gap> WedderburnDecompositionInfo(QS4);  
[ [ 1, Rationals ], [ 1, Rationals ], [ 3, Rationals ], [ 3, Rationals ], 
  [ 1, Rationals, 3, [ 2, 2, 0 ] ] ]
]]>
</Example>

In the previous example we computed the Wedderburn decomposition of the 
rational group algebra <M>QQ_{16}</M> of the quaternion group of order <M>16</M> 
and the rational group algebra <M>QS_{4}</M> of the symmetric group on four letters.
For both group algebras we used both <Ref Attr="WedderburnDecomposition" /> and 
<Ref Attr="WedderburnDecompositionInfo" />. <P/>

The output <Ref Attr="WedderburnDecomposition" /> shows that 
<Display>
QQ_{16} = 4 \Q \oplus M_2(\Q) \oplus A 
</Display>
<Display>
QS_{4} = 2Q \oplus 2 M_2(\Q) \oplus B
</Display>
where <M>A</M> and <M>B</M> are crossed products with coefficients in the 
cyclotomic fields <M>CF(8)</M> and <M>CF(3)</M> respectively. 
This output can be used as a &GAP; object, but it does not give clear 
information on the structure of algebras <M>A</M> and <M>B</M>. <P/>

Instead the numerical information displayed by 
<Ref Attr="WedderburnDecompositionInfo" /> means that 
  <Display>
  A = Q(\xi|\xi^8=1)[g | \xi^g = \xi^7 = \xi^{-1}, g^2 = \xi^4 = -1]
  </Display>
  <Display>
  B = Q(\xi|\xi^3=1)[g | \xi^g = \xi^2 = \xi^{-1}, g^2 = 1]
  </Display>
Both <M>A</M> and <M>B</M> are quaternion algebras over its centre which is
<M>Q(\xi+\xi^{-1})</M> and the former is equal to <M>Q(\sqrt{2})</M> and <M>Q</M> 
respectively. <P/>  

In <M>B</M>, one has <M>(g+1)(g-1)=0</M>, while <M>g</M> is neither <M>1</M> nor 
<M>-1</M>. This shows that <M>B=M_2(Q)</M>. 
However the relation <M>g^2=-1</M> in <M>A</M> shows that 
  <Display>
  A=Q(\sqrt{2})[i,g|i^2=g^2=-1,ig=-gi]
  </Display>
and so <M>A</M> is a division algebra with centre <M>Q(\sqrt{2})</M>, which is a 
subalgebra of the algebra of Hamiltonian quaternions. <P/>

In the next example we show the output of <C>WedderburnDecompositionInfo</C> 
for <C>SmallGroup(48,28)</C>. You can compare it with the output of
<Ref Attr="WedderburnDecomposition" /> for the same group in the previous section.

<Example>
<![CDATA[
gap> WedderburnDecompositionInfo( GroupRing( Rationals, SmallGroup(48,28) ) );
[ [ 1, Rationals ], [ 1, Rationals ], [ 3, Rationals ], [ 3, Rationals ], 
  [ 1, Rationals, 3, [ 2, 2, 0 ] ], [ 1, NF(8,[ 1, 7 ]), 8, [ 2, 7, 4 ] ], 
  [ 2, Rationals, 6, [ 2, 5, 3 ] ] ]
gap> WedderburnDecompositionInfo( GroupRing( CF(3), SmallGroup(48,28) ) );         
[ [ 1, CF(3) ], [ 1, CF(3) ], [ 3, CF(3) ], [ 3, CF(3) ], 
  [ 2, CF(3), 3, [ 1, 1, 0 ] ], [ 1, NF(24,[ 1, 7 ]), 8, [ 2, 7, 4 ] ], 
  [ 4, CF(3), 6, [ 1, 1, 0 ] ] ]
]]>
</Example>

</Section>

<Alt Only="LaTeX">\newpage</Alt> 

<!-- ********************************************************* -->

<Section Label="DecompSimple">
<Heading>Simple quotients</Heading>

<ManSection>
   <Oper Name="SimpleAlgebraByStronglySP" 
         Arg="QG K H"  
         Comm="The Wedderburn component of the rational group algebra QG 
         realized by (K,H), a strongly Shoda pair of G" />
   <Oper Name="SimpleAlgebraByStronglySP" 
         Arg="FG K H C"  
         Comm="The Wedderburn component of the semisimple finite group algebra 
         FG given realized by (K,H), a strongly Shoda pair of G, and a 
         q-cyclotomic class" />
   <Oper Name="SimpleAlgebraByStronglySPNC" 
         Arg="QG K H"  
         Comm="Same as the non NC version without checking that (K,H) is a 
         strongly Shoda pair of G" />
   <Oper Name="SimpleAlgebraByStronglySPNC" 
         Arg="FG K H C"  
         Comm="Same as the non NC version without checking that (K,H) is a 
         strongly Shoda pair of G" />
   <Returns>
         A simple algebra
   </Returns>
   <Description>
         The three-input versions computes the Wedderburn component 
         (<Ref Sect="WedDec" />) of the rational group algebra <A>QG</A> of a 
         finite group <M>G</M> realized by a strongly Shoda pair 
         (<A>K</A>,<A>H</A>) of <M>G</M> (see Section <Ref Sect="SSPDef"/>). <P/>
         
         The four-input versions computes the Wedderburn component of 
         the semisimple finite group algebra <A>FG</A> realized by a strongly 
         Shoda pair (<A>K</A>,<A>H</A>) of <M>G</M> and a generating 
         <M>q</M>-cyclotomic class modulo <M>[K:H]</M> 
         (see Section <Ref Sect="CyclotomicClass"/>).
         The cyclotomic class can be given either by the cyclotomic class itself 
         or by a representative, that is an integer coprime with <M>[K:H]</M>. <P/>
         
         The versions ended in NC does not check if (<A>K</A>,<A>H</A>) is a 
         strongly Shoda pair of <M>G</M> and, in the four-input version, 
         if <A>C</A> is either a generating <M>q</M>-cyclotomic class <A>C</A> 
         modulo <M>[K:H]</M> or an integer coprime with <M>[K:H]</M>.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> F:=FreeGroup("a","b");; a:=F.1;; b:=F.2;;
gap> G:=F/[ a^16, b^2*a^8, b^-1*a*b*a^9 ];; a:=G.1;; b:=G.2;;
gap> K:=Subgroup(G,[a]);; H:=Subgroup(G,[]);; 
gap> QG:=GroupRing( Rationals, G );;
gap> FG:=GroupRing( GF(7), G );;
gap> SimpleAlgebraByStronglySP( QG, K, H );
<crossed product over CF(16), with 2 generators>
gap> SimpleAlgebraByStronglySP( FG, K, H, [1,7] );
( GF(7)^[ 2, 2 ] )
gap> SimpleAlgebraByStronglySP( FG, K, H, 1 );
( GF(7)^[ 2, 2 ] )
]]>
</Example>

<!-- ************************ -->

<ManSection>
   <Oper Name="SimpleAlgebraByStronglySPInfo" 
         Arg="QG K H"  
         Comm="The numerical data describing the output of SimpleAlgebraByStronglySP" />
   <Oper Name="SimpleAlgebraByStronglySPInfo" 
         Arg="FG K H c"  
         Comm="The numerical data describing the output of SimpleAlgebraByStronglySP" />
   <Oper Name="SimpleAlgebraByStronglySPInfoNC" 
         Arg="FG K H c"  
         Comm="The numerical data describing the output of SimpleAlgebraByStronglySPNC" />         
   <Oper Name="SimpleAlgebraByStronglySPInfoNC" 
         Arg="QG K H"  
         Comm="The numerical data describing the output of SimpleAlgebraByStronglySPNC" />
   <Returns>
         numerical description of one simple algebra
   </Returns>
   <Description>
         The three-input versions computes the numerical information 
         describing the Wedderburn component (<Ref Sect="WedDec" />) of the 
         rational group algebra <A>QG</A> of a finite group <M>G</M> realized 
         by a strongly Shoda pair (<A>K</A>,<A>H</A>) of <M>G</M> 
         (see Section <Ref Sect="SSPDef"/>). <P/>
         
         The four-input versions computes a pair <M>[n,q]</M> of 
         positive integers with <M>q</M> a prime power describing the Wedderburn 
         component of the semisimple finite group algebra <A>FG</A> realized by a 
         strongly Shoda pair (<A>K</A>,<A>H</A>) of <M>G</M> and a generating 
         <M>q</M>-cyclotomic class <M>C</M> modulo <M>[K:H]</M> as the 
         <M>n</M> by <M>n</M> matrix algebra over <M>GF(q)</M> 
         (see Section <Ref Sect="CyclotomicClass"/>). <P/>
         
         The fourth input can be given either as a cyclotomic class or as
         its representative. <P/>

         The versions ended in NC does not check if (<A>K</A>,<A>H</A>)
         is a strongly Shoda pair of <M>G</M>, and, in the four-input version,
         if <M>C</M> is a generating <M>q</M>-cyclotomic class <M>C</M> modulo 
         <M>[K:H]</M> or an integer coprime with <M>[K:H]</M>.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> F:=FreeGroup("a","b");; a:=F.1;; b:=F.2;;
gap> G:=F/[ a^16, b^2*a^8, b^-1*a*b*a^9 ];; a:=G.1;; b:=G.2;;
gap> K:=Subgroup(G,[a]);; H:=Subgroup(G,[]);; 
gap> QG:=GroupRing( Rationals, G );;
gap> FG:=GroupRing( GF(7), G );;
gap> SimpleAlgebraByStronglySP( QG, K, H );
<crossed product over CF(16), with 2 generators>
gap> SimpleAlgebraByStronglySPInfo( QG, K, H );
[ 1, NF(16,[ 1, 7 ]), 16, [ [ 2, 7, 8 ] ], [  ] ]
gap> SimpleAlgebraByStronglySPInfo( FG, K, H, [1,7] );
[ 2, 7 ]
gap> SimpleAlgebraByStronglySPInfo( FG, K, H, 1 );
[ 2, 7 ]
]]>
</Example>

<!-- ************************ -->

<ManSection>
   <Oper Name="SimpleAlgebraByCharacter" 
         Arg="QG chi"  
         Comm="The Wedderburn component of the group algebra QG 
         determined by the irreducible character chi" />
   <Returns>
         numerical description of one simple algebra
   </Returns>
   <Description>
   </Description>
</ManSection>

<Example>
<![CDATA[
gap>
]]>
</Example>


<!-- ************************ -->

<ManSection>
   <Oper Name="SimpleAlgebraByCharacterInfo" 
         Arg="QG chi"  
         Comm="The numerical data describing the output of
         SimpleAlgebraByCharacter" />
   <Returns>
         The numerical description of SimpleAlgebraByStronglySP output
   </Returns>
   <Description>
   </Description>
</ManSection>

<Example>
<![CDATA[
gap>
]]>
</Example>

</Section>

</Chapter>
