<!-- $Id$ -->

<!-- ********************Decomp******************** -->
<Chapter Label="Decomp">
<Heading>Wedderburn decomposition</Heading>

<Section Label="DecompDecomp">
<Heading>Wedderburn decomposition</Heading>

<ManSection>
   <Attr Name="WedderburnDecomposition" 
         Arg="FG"  
         Comm="The Wedderburn decomposition of a group algebras given as a list 
         of GAP objects" />
   <Returns>
         a list of simple algebras
   </Returns>
   <Description>
         The input <A>FG</A> should be a group algebra of a finite group <M>G</M> 
         over the field <M>F</M>, where <M>F</M> is either and abelian number field 
         (i.e. a subfield of a finite cyclotomic extension of the rationals) or a finite field of characteristic coprime 
         with the order of <M>G</M>. <P/> 
         
         The function returns the list of all <E>Wedderburn components</E>
         (<Ref Sect="WedDec" />) of the group algebra <A>FG</A>. 
         If <M>F</M> is an abelian number field then the Wedderburn components are given as matrix algebras
         over cyclotomic algebras (<Ref Sect="Cyclotomic" />). 
         If <M>F</M> is finite then the Wedderburn components are given as matrix algebras over finite fields.         
         <P/> 
         
         
            </Description>
</ManSection>


<Example>
<![CDATA[
gap> WedderburnDecomposition( GroupRing( GF(5), DihedralGroup(16) ) );
[ ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 1, 1 ] ),
  ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 2, 2 ] ), ( GF(5^2)^[ 2, 2 ] ) ]
gap> WedderburnDecomposition( GroupRing( Rationals, DihedralGroup(16) ) );
[ Rationals, Rationals, Rationals, Rationals, ( Rationals^[ 2, 2 ] ),
  <crossed product over AsField( NF(8,[ 1, 7 ]), CF(8) ), with
    2 generators and center=NF(8,[ 1, 7 ])> ]
gap> WedderburnDecomposition( GroupRing( CF(5), DihedralGroup(16) ) );
[ CF(5), CF(5), CF(5), CF(5), ( CF(5)^[ 2, 2 ] ),
  <crossed product over AsField( NF(40,[ 1, 31 ]), CF(40) ), with
    2 generators and center=NF(40,[ 1, 31 ])> ]
]]>
</Example>

The previous examples show that if <M>D_{16}</M> denotes the dihedral group of order <M>16</M> then 
the Wedderburn decompositions of <M>GF(5) D_{16}</M>, <M>QD_{16}</M> and <M>CF(5)</M> are
  <Display>
  GF(5) D_{16} = 4 GF(5) \oplus M_2(GF(5)) \oplus M_2(GF(25)).  
  </Display>
  <Display>
  Q D_{16} = 4 Q \oplus M_2(Q) \oplus (K(\xi_8)/K,t).  
  </Display>
  <Display>
  CF(5) D_{16} = 4 CF(5) \oplus M_2(CF(5)) \oplus (F(\xi_{40})/F,t).  
  </Display>
where <M>(K(\xi_8)/K,t)</M> is a cyclotomic algebra with centre  <M>K=NF(8,[ 1, 7 ])=Q(\sqrt{2})</M>, 
<M>(F(\xi_{40})/F,t)</M> is a cyclotomic algebra with centre  <M>F=NF(40,[ 1, 31 ])</M> and <M>\xi_n</M> denotes a 
<M>n</M>-th root of unity.
<P/>

Two more example

<Example>
<![CDATA[
gap> WedderburnDecomposition( GroupRing( Rationals, SmallGroup(48,15) ) );
[ Rationals, Rationals, Rationals, Rationals, ( Rationals^[ 2, 2 ] ),
  <crossed product over CF(3), with 2 generators and center=Rationals>,
  ( CF(3)^[ 2, 2 ] ), <crossed product over CF(3), with
    2 generators and center=Rationals>, <crossed product over AsField( NF(8,
    [ 1, 7 ]), CF(8) ), with 2 generators and center=NF(8,[ 1, 7 ])>,
  <crossed product over CF(12), with 4 generators and center=Rationals> ]
gap> WedderburnDecomposition( GroupRing( CF(3), SmallGroup(48,15) ) );
[ CF(3), CF(3), CF(3), CF(3), ( CF(3)^[ 2, 2 ] ), ( CF(3)^[ 2, 2 ] ),
  ( CF(3)^[ 2, 2 ] ), ( CF(3)^[ 2, 2 ] ), ( CF(3)^[ 2, 2 ] ),
  <crossed product over AsField( NF(24,[ 1, 7 ]), CF(24) ), with
    2 generators and center=NF(24,[ 1, 7 ])>,
  ( <crossed product over AsField( CF(3), CF(12) ), with
    2 generators and center=CF(3)>^[ 2, 2 ] ) ]
]]>
</Example>

In some exceptional cases, as in the following example, the output of WedderburnDecomposition do not provide
a full matrix algebra of a cyclotomic algebra, but a "fractional matrix algebra". See <Ref Sect="WedDec" /> for 
a theoretical explanation of this phenomenon. In that case a warning message is displayed.

<Example>
<![CDATA[
gap> QG:=GroupRing(Rationals,SmallGroup(240,89));
<algebra-with-one over Rationals, with 2 generators>
gap> WedderburnDecomposition(QG);
Wedderga: Warning!!!
Some of the Wedderburn components displayed are FRACTIONAL MATRIX ALGEBRAS!!!

[ Rationals, Rationals, <crossed product over CF(5), with
    4 generators and center=Rationals>, ( Rationals^[ 4, 4 ] ),
  ( Rationals^[ 4, 4 ] ), ( Rationals^[ 5, 5 ] ), ( Rationals^[ 5, 5 ] ),
  ( Rationals^[ 6, 6 ] ),
  [ 1/2, <crossed product over AsField( NF(12,[ 1, 11 ]), CF(60) ), with
        8 generators and center=NF(12,[ 1, 11 ])> ],
  [ 3/4, <crossed product over AsField( NF(8,[ 1, 7 ]), CF(40) ), with
        8 generators and center=NF(8,[ 1, 7 ])> ] ]
]]>
</Example>



<!-- ************************ -->

<ManSection>
   <Attr Name="WedderburnDecompositionInfo" 
         Arg="FG"  
         Comm="The Wedderburn decomposition of a group algebras given as a list of lists of numerical data 
         describing each Wedderburn component" />
   <Returns>
         a list of numerical descriptions of simple algebras
   </Returns>
   <Description>
         This function is a counterpart of <Ref Attr="WedderburnDecomposition" />
         which uses the same group algebra <A>FG</A> as input and 
         computes the numerical data describing the Wedderburn components 
         of the group algebra <A>FG</A>.<P/>
         
         The entries in the output are list of length 2, 4 or 5. The interpretation of this list is explaine in
         (see <Ref Sect="NumDesc" />).
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> WedderburnDecompositionInfo( GroupRing( Rationals, DihedralGroup(16) ) )
[ [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ],
  [ 2, Rationals ], [ 1, NF(8,[ 1, 7 ]), 8, [ 2, 7, 0 ] ] ]
gap> WedderburnDecompositionInfo( GroupRing( CF(5), DihedralGroup(16) ) );
[ [ 1, CF(5) ], [ 1, CF(5) ], [ 1, CF(5) ], [ 1, CF(5) ], [ 2, CF(5) ],
  [ 1, NF(40,[ 1, 31 ]), 8, [ 2, 7, 0 ] ] ]
]]>
</Example>

An intrepretation of the previous example <Ref Sect="NumDesc" /> give rise to the following Wedderburn decompositions
where <M>F=NF(40,[ 1, 31 ])</M>.
  <Display>
  Q D_{16} = 4 Q \oplus M_2(Q) \oplus M_2(Q(\sqrt{2})).  
  </Display>
  <Display>
  CF(5) D_{16} = 4 CF(5) \oplus M_2(CF(5)) \oplus M_2(F(\sqrt{2}).  
  </Display>

<Example>
<![CDATA[
gap> F:=FreeGroup("a","b");;a:=F.1;;b:=F.2;;rel:=[a^8,a^4*b^2,b^-1*a*b*a];;
gap> Q16:=F/rel;; QQ16:=GroupRing( Rationals, Q16 );;
gap> QS4:=GroupRing( Rationals, SymmetricGroup(4) );;
gap> WedderburnDecomposition(QQ16);
[ Rationals, Rationals, Rationals, Rationals, ( Rationals^[ 2, 2 ] ), 
  <crossed product over AsField( NF(8,[ 1, 7 ]), CF(8) ), with 2 generators 
    and center=NF(8,[ 1, 7 ])> ]
gap> WedderburnDecomposition( QS4 );  
[ Rationals, Rationals, ( Rationals^[ 3, 3 ] ), ( Rationals^[ 3, 3 ] ), 
  <crossed product over CF(3), with 2 generators and center=Rationals> ]
gap> WedderburnDecompositionInfo(QQ16);
[ [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ], 
  [ 2, Rationals ], [ 1, NF(8,[ 1, 7 ]), 8, [ 2, 7, 4 ] ] ]
gap> WedderburnDecompositionInfo(QS4);  
[ [ 1, Rationals ], [ 1, Rationals ], [ 3, Rationals ], [ 3, Rationals ], 
  [ 1, Rationals, 3, [ 2, 2, 0 ] ] ]
]]>
</Example>

In the previous example we computed the Wedderburn decomposition of the 
rational group algebra <M>QQ_{16}</M> of the quaternion group of order <M>16</M> 
and the rational group algebra <M>QS_{4}</M> of the symmetric group on four letters.
For both group algebras we used both <Ref Attr="WedderburnDecomposition" /> and 
<Ref Attr="WedderburnDecompositionInfo" />. <P/>

The output <Ref Attr="WedderburnDecomposition" /> shows that 
  <Display>
  QQ_{16} = 4 \Q \oplus M_2(\Q) \oplus A 
  </Display>
  <Display>
  QS_{4} = 2Q \oplus 2 M_2(\Q) \oplus B
  </Display>
where <M>A</M> and <M>B</M> are crossed products with coefficients in the 
cyclotomic fields <M>CF(8)</M> and <M>CF(3)</M> respectively. 
This output can be used as a &GAP; object, but it does not give clear 
information on the structure of algebras <M>A</M> and <M>B</M>. <P/>

Instead the numerical information displayed by 
<Ref Attr="WedderburnDecompositionInfo" /> means that 
  <Display>
  A = Q(\xi|\xi^8=1)[g | \xi^g = \xi^7 = \xi^{-1}, g^2 = \xi^4 = -1]
  </Display>
  <Display>
  B = Q(\xi|\xi^3=1)[g | \xi^g = \xi^2 = \xi^{-1}, g^2 = 1]
  </Display>
Both <M>A</M> and <M>B</M> are quaternion algebras over its centre which is
<M>Q(\xi+\xi^{-1})</M> and the former is equal to <M>Q(\sqrt{2})</M> and <M>Q</M> 
respectively. <P/>  

In <M>B</M>, one has <M>(g+1)(g-1)=0</M>, while <M>g</M> is neither <M>1</M> nor 
<M>-1</M>. This shows that <M>B=M_2(Q)</M>. 
However the relation <M>g^2=-1</M> in <M>A</M> shows that 
  <Display>
  A=Q(\sqrt{2})[i,g|i^2=g^2=-1,ig=-gi]
  </Display>
and so <M>A</M> is a division algebra with centre <M>Q(\sqrt{2})</M>, which is a 
subalgebra of the algebra of Hamiltonian quaternions. <P/>

Next examples show the output of <C>WedderburnDecompositionInfo</C> 
for <M>QG</M> where <M>G=SmallGroup(48,28)</M>. You can compare it with the output of
<Ref Attr="WedderburnDecomposition" /> for the same group in the previous section.
Notice that the last entry of the the Wedderburn decomposition of <M>QG</M> is not presented as a matrix
algebra of a cyclic algebra but this is not the case for the corresponding entry of <M>CF(3)G</M>.

<Example>
<![CDATA[
gap> WedderburnDecompositionInfo( GroupRing( Rationals, SmallGroup(48,15) ) );
[ [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ],
  [ 2, Rationals ], [ 1, Rationals, 3, [ 2, 2, 0 ] ], [ 2, CF(3) ],
  [ 1, Rationals, 6, [ 2, 5, 0 ] ], [ 1, NF(8,[ 1, 7 ]), 8, [ 2, 7, 0 ] ],
  [ 1, Rationals, 12, [ [ 2, 5, 9 ], [ 2, 7, 0 ] ], [ [ 9 ] ] ] ]
gap> WedderburnDecompositionInfo( GroupRing( CF(3), SmallGroup(48,15) ) );
[ [ 1, CF(3) ], [ 1, CF(3) ], [ 1, CF(3) ], [ 1, CF(3) ], [ 2, CF(3) ],
  [ 2, CF(3), 3, [ 1, 1, 0 ] ], [ 2, CF(3) ], [ 2, CF(3) ],
  [ 2, CF(3), 6, [ 1, 1, 0 ] ], [ 1, NF(24,[ 1, 7 ]), 8, [ 2, 7, 0 ] ],
  [ 2, CF(3), 12, [ 2, 7, 0 ] ] ]
]]>
</Example>

</Section>

<Alt Only="LaTeX">\newpage</Alt> 

<!-- ********************************************************* -->

<Section Label="DecompSimple">
<Heading>Simple quotients</Heading>

<ManSection>
   <Oper Name="SimpleAlgebraByStronglySP" 
         Arg="QG K H"  
         Comm="The Wedderburn component of the rational group algebra QG 
         realized by (K,H), a strongly Shoda pair of G" />
   <Oper Name="SimpleAlgebraByStronglySP" 
         Arg="FG K H C"  
         Comm="The Wedderburn component of the semisimple finite group algebra 
         FG given realized by (K,H), a strongly Shoda pair of G, and a 
         q-cyclotomic class" />
   <Oper Name="SimpleAlgebraByStronglySPNC" 
         Arg="QG K H"  
         Comm="Same as the non NC version without checking that (K,H) is a 
         strongly Shoda pair of G" />
   <Oper Name="SimpleAlgebraByStronglySPNC" 
         Arg="FG K H C"  
         Comm="Same as the non NC version without checking that (K,H) is a 
         strongly Shoda pair of G" />
   <Returns>
         A simple algebra
   </Returns>
   <Description>
         The three-input versions computes the Wedderburn component 
         (<Ref Sect="WedDec" />) of the rational group algebra <A>QG</A> of a 
         finite group <M>G</M> realized by a strongly Shoda pair 
         (<A>K</A>,<A>H</A>) of <M>G</M> (see Section <Ref Sect="SSPDef"/>). <P/>
         
         The four-input versions computes the Wedderburn component of 
         the semisimple finite group algebra <A>FG</A> realized by a strongly 
         Shoda pair (<A>K</A>,<A>H</A>) of <M>G</M> and a generating 
         <M>q</M>-cyclotomic class modulo <M>[K:H]</M> 
         (see Section <Ref Sect="CyclotomicClass"/>).
         The cyclotomic class can be given either by the cyclotomic class itself 
         or by a representative, that is an integer coprime with <M>[K:H]</M>. <P/>
         
         The versions ended in NC does not check if (<A>K</A>,<A>H</A>) is a 
         strongly Shoda pair of <M>G</M> and, in the four-input version, 
         if <A>C</A> is either a generating <M>q</M>-cyclotomic class <A>C</A> 
         modulo <M>[K:H]</M> or an integer coprime with <M>[K:H]</M>.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> F:=FreeGroup("a","b");; a:=F.1;; b:=F.2;;
gap> G:=F/[ a^16, b^2*a^8, b^-1*a*b*a^9 ];; a:=G.1;; b:=G.2;;
gap> K:=Subgroup(G,[a]);; H:=Subgroup(G,[]);; 
gap> QG:=GroupRing( Rationals, G );;
gap> FG:=GroupRing( GF(7), G );;
gap> SimpleAlgebraByStronglySP( QG, K, H );
<crossed product over CF(16), with 2 generators>
gap> SimpleAlgebraByStronglySP( FG, K, H, [1,7] );
( GF(7)^[ 2, 2 ] )
gap> SimpleAlgebraByStronglySP( FG, K, H, 1 );
( GF(7)^[ 2, 2 ] )
]]>
</Example>

<!-- ************************ -->

<ManSection>
   <Oper Name="SimpleAlgebraByStronglySPInfo" 
         Arg="QG K H"  
         Comm="The numerical data describing the output of SimpleAlgebraByStronglySP" />
   <Oper Name="SimpleAlgebraByStronglySPInfo" 
         Arg="FG K H c"  
         Comm="The numerical data describing the output of SimpleAlgebraByStronglySP" />
   <Oper Name="SimpleAlgebraByStronglySPInfoNC" 
         Arg="FG K H c"  
         Comm="The numerical data describing the output of SimpleAlgebraByStronglySPNC" />         
   <Oper Name="SimpleAlgebraByStronglySPInfoNC" 
         Arg="QG K H"  
         Comm="The numerical data describing the output of SimpleAlgebraByStronglySPNC" />
   <Returns>
         numerical description of one simple algebra
   </Returns>
   <Description>
         The three-input versions computes the numerical information 
         describing the Wedderburn component (<Ref Sect="WedDec" />) of the 
         rational group algebra <A>QG</A> of a finite group <M>G</M> realized 
         by a strongly Shoda pair (<A>K</A>,<A>H</A>) of <M>G</M> 
         (see Section <Ref Sect="SSPDef"/>). <P/>
         
         The four-input versions computes a pair <M>[n,q]</M> of 
         positive integers with <M>q</M> a prime power describing the Wedderburn 
         component of the semisimple finite group algebra <A>FG</A> realized by a 
         strongly Shoda pair (<A>K</A>,<A>H</A>) of <M>G</M> and a generating 
         <M>q</M>-cyclotomic class <M>C</M> modulo <M>[K:H]</M> as the 
         <M>n</M> by <M>n</M> matrix algebra over <M>GF(q)</M> 
         (see Section <Ref Sect="CyclotomicClass"/>). <P/>
         
         The fourth input can be given either as a cyclotomic class or as
         its representative. <P/>

         The versions ended in NC does not check if (<A>K</A>,<A>H</A>)
         is a strongly Shoda pair of <M>G</M>, and, in the four-input version,
         if <M>C</M> is a generating <M>q</M>-cyclotomic class <M>C</M> modulo 
         <M>[K:H]</M> or an integer coprime with <M>[K:H]</M>.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> F:=FreeGroup("a","b");; a:=F.1;; b:=F.2;;
gap> G:=F/[ a^16, b^2*a^8, b^-1*a*b*a^9 ];; a:=G.1;; b:=G.2;;
gap> K:=Subgroup(G,[a]);; H:=Subgroup(G,[]);; 
gap> QG:=GroupRing( Rationals, G );;
gap> FG:=GroupRing( GF(7), G );;
gap> SimpleAlgebraByStronglySP( QG, K, H );
<crossed product over CF(16), with 2 generators>
gap> SimpleAlgebraByStronglySPInfo( QG, K, H );
[ 1, NF(16,[ 1, 7 ]), 16, [ [ 2, 7, 8 ] ], [  ] ]
gap> SimpleAlgebraByStronglySPInfo( FG, K, H, [1,7] );
[ 2, 7 ]
gap> SimpleAlgebraByStronglySPInfo( FG, K, H, 1 );
[ 2, 7 ]
]]>
</Example>

<!-- ************************ -->

<ManSection>
   <Oper Name="SimpleAlgebraByCharacter" 
         Arg="FG chi"  
         Comm="The Wedderburn component of the group algebra FG 
         determined by the irreducible character chi" />
   <Returns>
         A simple algebra.
   </Returns>
   <Description>
        The first input <A>FG</A> is a semisimple group algebra over a finite group <M>G</M> and the second
        input is an irreducible character of <M>G</M>.
        
        The output is a matrix algebra of a cyclotomic algebra which is isomorphic to the unique 
        Wedderburn component <M>A</M> of <A>FG</A> such that <M>\chi(A)\ne 0</M>.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> A5 := AlternatingGroup(5);
Alt( [ 1 .. 5 ] )
gap> SimpleAlgebraByCharacter( GroupRing( Rationals , A5 ) , Irr( A5) [3] );
( NF(5,[ 1, 4 ])^[ 3, 3 ] )
gap> SimpleAlgebraByCharacter( GroupRing( GF(7) , A5 ) , Irr( A5) [3] );
( GF(7^2)^[ 3, 3 ] )
gap> G:=SmallGroup(128,100);
<pc group of size 128 with 7 generators>
gap> SimpleAlgebraByCharacter( GroupRing( Rationals , G ) , Irr(G)[19] );
<crossed product over AsField( NF(8,[ 1, 3 ]), CF(8) ), with
2 generators and center=NF(8,[ 1, 3 ])>
]]>
</Example>


<!-- ************************ -->

<ManSection>
   <Oper Name="SimpleAlgebraByCharacterInfo" 
         Arg="QG chi"  
         Comm="The numerical data describing the output of
         SimpleAlgebraByCharacter" />
   <Returns>
         The numerical description of the output of SimpleAlgebraByCharacter
   </Returns>
   <Description>
        The first input <A>FG</A> is a semisimple group algebra over a finite group <M>G</M> and the second
        input is an irreducible character of <M>G</M>.
        
        The output is the numerical description a cyclotomic algebra which is isomorphic to the unique 
        Wedderburn component <M>A</M> of <A>FG</A> such that <M>\chi(A)\ne 0</M>. <P/>
        
        See <Ref Sect="NumDesc" /> for 
        the interpretation of the numerical information given by the output.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> G:=SmallGroup(144,11);
<pc group of size 144 with 6 generators>
gap> QG:=GroupRing(Rationals,G);
<algebra-with-one over Rationals, with 6 generators>
gap> SimpleAlgebraByCharacter( QG , Irr(G)[48] );
<crossed product over AsField( NF(36,[ 1, 17 ]), CF(36) ), with
2 generators and center=NF(36,[ 1, 17 ])>
gap> SimpleAlgebraByCharacterInfo( QG , Irr(G)[48] );
[ 1, NF(36,[ 1, 17 ]), 36, [ 2, 17, 18 ] ]
]]>
</Example>

</Section>

</Chapter>
