<!-- $Id$ -->

<!-- ********************Decomp******************** -->
<Chapter Label="Decomp">
<Heading>Wedderburn decomposition</Heading>

<Section Label="DecompDecomp">
<Heading>Wedderburn decomposition</Heading>

<ManSection>
   <Attr Name="WedderburnDecomposition" 
         Arg="FG"  
         Comm="The Wedderburn decomposition of a group algebras given as a list 
         of GAP objects" />
   <Returns>
         a list of simple algebras
   </Returns>
   <Description>
         The input <A>FG</A> should be a group algebra of a finite group <M>G</M> 
         over the field <M>F</M>, where <M>F</M> is either an abelian number field 
         (i.e. a subfield of a finite cyclotomic extension of the rationals) or a finite field of characteristic coprime 
         with the order of <M>G</M>. <P/> 
         
         The function returns the list of all <E>Wedderburn components</E>
         (<Ref Sect="WedDec" />) of the group algebra <A>FG</A>. 
         If <M>F</M> is an abelian number field then each Wedderburn component is given as a matrix algebras
         of a <E>cyclotomic algebra</E> <Ref Sect="Cyclotomic" />. 
         If <M>F</M> is finite then the Wedderburn components are given as matrix algebras over finite fields.         
         <P/> 
         
         
            </Description>
</ManSection>


<Example>
<![CDATA[
gap> WedderburnDecomposition( GroupRing( GF(5), DihedralGroup(16) ) );
[ ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 1, 1 ] ),
  ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 2, 2 ] ), ( GF(5^2)^[ 2, 2 ] ) ]
gap> WedderburnDecomposition( GroupRing( Rationals, DihedralGroup(16) ) );
[ Rationals, Rationals, Rationals, Rationals, ( Rationals^[ 2, 2 ] ),
  <crossed product with center NF(8,[ 1, 7 ]) over AsField( NF(8,
    [ 1, 7 ]), CF(8) ) of a group of size 2> ]
gap> WedderburnDecomposition( GroupRing( CF(5), DihedralGroup(16) ) );
[ CF(5), CF(5), CF(5), CF(5), ( CF(5)^[ 2, 2 ] ),
  <crossed product with center NF(40,[ 1, 31 ]) over AsField( NF(40,
    [ 1, 31 ]), CF(40) ) of a group of size 2> ]
]]>
</Example>

The previous examples show that if <M>D_{16}</M> denotes the dihedral group of order <M>16</M> then 
the <E>Wedderburn decomposition</E> <Ref Sect="WedDec" /> of <M>GF(5) D_{16}</M>, <M>QD_{16}</M> and <M>CF(5)D_{16}</M> are
  <Display>
  GF(5) D_{16} = 4 GF(5) \oplus M_2(GF(5)) \oplus M_2(GF(25)).  
  </Display>
  <Display>
  Q D_{16} = 4 Q \oplus M_2(Q) \oplus (K(\xi_8)/K,t).  
  </Display>
  <Display>
  CF(5) D_{16} = 4 CF(5) \oplus M_2(CF(5)) \oplus (F(\xi_{40})/F,t).  
  </Display>
where <M>(K(\xi_8)/K,t)</M> is a <E>cyclotomic algebras</E> <Ref Sect="Cyclotomic" /> with centre  <M>K=NF(8,[ 1, 7 ])=Q(\sqrt{2})</M>, 
<M>(F(\xi_{40})/F,t) = Q(\sqrt{2},\xi_5)</M> is a cyclotomic algebra with centre  <M>F=NF(40,[ 1, 31 ])</M> and 
<M>\xi_n</M> denotes a <M>n</M>-th root of unity.
<P/>

Two more examples

<Example>
<![CDATA[
gap> WedderburnDecomposition( GroupRing( Rationals, SmallGroup(48,15) ) );
[ Rationals, Rationals, Rationals, Rationals, ( Rationals^[ 2, 2 ] ),
  <crossed product with center Rationals over CF(3) of a group of size 2>,
  ( CF(3)^[ 2, 2 ] ), <crossed product with center Rationals over CF(
    3) of a group of size 2>, <crossed product with center NF(8,
    [ 1, 7 ]) over AsField( NF(8,[ 1, 7 ]), CF(8) ) of a group of size 2>,
  <crossed product with center Rationals over CF(12) of a group of size 4> ]
gap> WedderburnDecomposition( GroupRing( CF(3), SmallGroup(48,15) ) );
[ CF(3), CF(3), CF(3), CF(3), ( CF(3)^[ 2, 2 ] ), ( CF(3)^[ 2, 2 ] ),
  ( CF(3)^[ 2, 2 ] ), ( CF(3)^[ 2, 2 ] ), ( CF(3)^[ 2, 2 ] ),
  <crossed product with center NF(24,[ 1, 7 ]) over AsField( NF(24,
    [ 1, 7 ]), CF(24) ) of a group of size 2>,
  ( <crossed product with center CF(3) over AsField( CF(3), CF(
    12) ) of a group of size 2>^[ 2, 2 ] ) ]
]]>
</Example>

In some cases the output of <Ref Attr="WedderburnDecomposition" /> do not provide
a full matrix algebra of a <E>cyclotomic algebras</E> <Ref Sect="Cyclotomic" />, 
but a "fractional matrix algebra". See <Ref Sect="WedDec" /> for a theoretical explanation of this phenomenon. 

<Example>
<![CDATA[
gap> QG:=GroupRing(Rationals,SmallGroup(240,89));
<algebra-with-one over Rationals, with 2 generators>
gap> WedderburnDecomposition(QG);
Wedderga: Warning!!!
Some of the Wedderburn components displayed are FRACTIONAL MATRIX ALGEBRAS!!!

[ Rationals, Rationals, <crossed product with center Rationals over CF(
    5) of a group of size 4>, ( Rationals^[ 4, 4 ] ), ( Rationals^[ 4, 4 ] ),
  ( Rationals^[ 5, 5 ] ), ( Rationals^[ 5, 5 ] ), ( Rationals^[ 6, 6 ] ),
  [ 1/2, <crossed product with center NF(12,[ 1, 11 ]) over AsField( NF(12,
        [ 1, 11 ]), CF(60) ) of a group of size 8> ],
  [ 3/4, <crossed product with center NF(8,[ 1, 7 ]) over AsField( NF(8,
        [ 1, 7 ]), CF(40) ) of a group of size 8> ] ]
]]>
</Example>



<!-- ************************ -->

<ManSection>
   <Attr Name="WedderburnDecompositionInfo" 
         Arg="FG"  
         Comm="The Wedderburn decomposition of a group algebras given as a list of lists of numerical data 
         describing each Wedderburn component" />
   <Returns>
         a list of numerical descriptions of a <E>cyclotomic algebras</E> <Ref Sect="Cyclotomic" />.
   </Returns>
   <Description>
         The input <A>FG</A> should be a group algebra of a finite group <M>G</M> 
         over the field <M>F</M>, where <M>F</M> is either an abelian number field 
         (i.e. a subfield of a finite cyclotomic extension of the rationals) or a finite field of characteristic coprime 
         with the order of <M>G</M>. <P/> 
         
         The function returns a list formed by lists of length 2, 4 or 5. <P/> 
         
         The lists of length 2 are of the form 
         <Display>
          [n,F]
          </Display>  <P/>
         where <M>n</M> is a positive integer and <M>F</M> is a field. 
         It represents the <M>n\times n</M> matrix algebra <M>M_n(F)</M> over the field <M>F</M>.<P/> 
         
         The lists of length 4 are of the form 
         <Display>
         [n,F,k,[o,\alpha,\beta]],
         </Display>
         where <M>F</M> is a field and <M>n,k,o,\alpha,\beta</M> are non negative integers. 
         It represents the <M>n\times n</M> matrix algebra <M>M_n(A)</M> over the cyclic algebra
         <Display>
         A=F(\xi_k,u| | \xi^u = \xi^{\alpha}, \xi^o = \xi^{\beta})
         </Display>
         where <M>\xi_k</M> is a primitive <M>k</M>-th root of unity. <P/>
         
         The lists of length 5 are of the form 
           <Display>
           [n,F,k,[o_i,\alpha_i,\beta_i]_{i=1}^m, [\gamma_{j,k}]_{1\le i &lt; j \le m} ]
           </Display>
          where <M>F</M> is a field and <M>n,k,o_i,\alpha_i,\beta_i,\gamma_{j,k}</M> are non negative integers. 
         It represents the <M>n\times n</M> matrix algebra <M>M_n(A)</M> over the <E>cyclotomic algebras</E> <Ref Sect="Cyclotomic" />
         <Display>
          A = F(\xi_k)[g_1,\ldots,g_m \mid 
          \xi_k^{g_i} = \xi_k^{\alpha_i}, g_i^{o_i}=\xi_k^{\beta_i}, g_jg_i=\xi_k^{\gamma_{ij}} g_i g_j]
          </Display>
          where <M>\xi_k</M> is a primitive <M>k</M>-th root of unity.
         (see <Ref Sect="NumDesc" />).   <P/>
   
         This function is a counterpart of <Ref Attr="WedderburnDecomposition" />
         which uses the same group algebra <A>FG</A> as input and computes the numerical data 
         describing the <E>Wedderburn components</E> (<Ref Sect="WedDec" />) of the group algebra <A>FG</A>, 
         given by <Ref Attr="WedderburnDecomposition" />.<P/>
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> WedderburnDecompositionInfo( GroupRing( Rationals, DihedralGroup(16) ) );
[ [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ],
  [ 2, Rationals ], [ 1, NF(8,[ 1, 7 ]), 8, [ 2, 7, 0 ] ] ]
gap> WedderburnDecompositionInfo( GroupRing( CF(5), DihedralGroup(16) ) );
[ [ 1, CF(5) ], [ 1, CF(5) ], [ 1, CF(5) ], [ 1, CF(5) ], [ 2, CF(5) ],
  [ 1, NF(40,[ 1, 31 ]), 8, [ 2, 7, 0 ] ] ]
]]>
</Example>

The interpretation of the previous example gives rise to the following 
<E>Wedderburn decomposition</E> <Ref Sect="WedDec" />, where
<M>\xi_5</M> is a primitive <M>5</M>-th root of unity.
  <Display>
  Q D_{16} = 4 Q \oplus M_2(Q) \oplus M_2(Q(\sqrt{2})).  
  </Display>
  <Display>
  CF(5) D_{16} = 4 Q(\xi_5) \oplus M_2(Q(\xi_5)) \oplus M_2(Q(\xi_5,\sqrt{2}).  
  </Display>

<Example>
<![CDATA[
gap> F:=FreeGroup("a","b");;a:=F.1;;b:=F.2;;rel:=[a^8,a^4*b^2,b^-1*a*b*a];;
gap> Q16:=F/rel;; QQ16:=GroupRing( Rationals, Q16 );;
gap> QS4:=GroupRing( Rationals, SymmetricGroup(4) );;
gap> WedderburnDecomposition(QQ16);
[ Rationals, Rationals, Rationals, Rationals, ( Rationals^[ 2, 2 ] ),
  <crossed product with center NF(8,[ 1, 7 ]) over AsField( NF(8,
    [ 1, 7 ]), CF(8) ) of a group of size 2> ]
gap> WedderburnDecomposition( QS4 );
[ Rationals, Rationals, ( Rationals^[ 3, 3 ] ), ( Rationals^[ 3, 3 ] ),
  <crossed product with center Rationals over CF(3) of a group of size 2> ]
gap> WedderburnDecompositionInfo(QQ16);
[ [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ], 
  [ 2, Rationals ], [ 1, NF(8,[ 1, 7 ]), 8, [ 2, 7, 4 ] ] ]
gap> WedderburnDecompositionInfo(QS4);  
[ [ 1, Rationals ], [ 1, Rationals ], [ 3, Rationals ], [ 3, Rationals ], 
  [ 1, Rationals, 3, [ 2, 2, 0 ] ] ]
]]>
</Example>

In the previous example we computed the Wedderburn decomposition of the 
rational group algebra <M>QQ_{16}</M> of the quaternion group of order <M>16</M> 
and the rational group algebra <M>QS_{4}</M> of the symmetric group on four letters.
For both group algebras we used both <Ref Attr="WedderburnDecomposition" /> and 
<Ref Attr="WedderburnDecompositionInfo" />. <P/>

The output of <Ref Attr="WedderburnDecomposition" /> shows that 
  <Display>
  QQ_{16} = 4 \Q \oplus M_2(\Q) \oplus A 
  </Display>
  <Display>
  QS_{4} = 2Q \oplus 2 M_2(\Q) \oplus B
  </Display>
where <M>A</M> and <M>B</M> are <E>crossed product</E> <Ref Sect="CrossedProd" />s with coefficients in the 
cyclotomic fields <M>CF(8)</M> and <M>CF(3)</M> respectively. 
This output can be used as a &GAP; object, but it does not give clear 
information on the structure of algebras <M>A</M> and <M>B</M>. <P/>

The numerical information displayed by 
<Ref Attr="WedderburnDecompositionInfo" /> means that 
  <Display>
  A = Q(\xi|\xi^8=1)[g | \xi^g = \xi^7 = \xi^{-1}, g^2 = \xi^4 = -1]
  </Display>
  <Display>
  B = Q(\xi|\xi^3=1)[g | \xi^g = \xi^2 = \xi^{-1}, g^2 = 1]
  </Display>
Both <M>A</M> and <M>B</M> are quaternion algebras over its centre which is
<M>Q(\xi+\xi^{-1})</M> and the former is equal to <M>Q(\sqrt{2})</M> and <M>Q</M> 
respectively. <P/>  

In <M>B</M>, one has <M>(g+1)(g-1)=0</M>, while <M>g</M> is neither <M>1</M> nor 
<M>-1</M>. This shows that <M>B=M_2(Q)</M>. 
However the relation <M>g^2=-1</M> in <M>A</M> shows that 
  <Display>
  A=Q(\sqrt{2})[i,g|i^2=g^2=-1,ig=-gi]
  </Display>
and so <M>A</M> is a division algebra with centre <M>Q(\sqrt{2})</M>, which is a 
subalgebra of the algebra of Hamiltonian quaternions. <P/>

Next examples show the output of <C>WedderburnDecompositionInfo</C> 
for <M>QG</M> where <M>G=SmallGroup(48,28)</M>. You can compare it with the output of
<Ref Attr="WedderburnDecomposition" /> for the same group in the previous section.
Notice that the last entry of the the <E>Wedderburn decomposition</E> <Ref Sect="WedDec" /> 
of <M>QG</M> is not presented as a matrix algebra of a cyclic algebra but this is not the case for the corresponding entry of <M>CF(3)G</M>.

<Example>
<![CDATA[
gap> WedderburnDecompositionInfo( GroupRing( Rationals, SmallGroup(48,15) ) );
[ [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals ],
  [ 2, Rationals ], [ 1, Rationals, 3, [ 2, 2, 0 ] ], [ 2, CF(3) ],
  [ 1, Rationals, 6, [ 2, 5, 0 ] ], [ 1, NF(8,[ 1, 7 ]), 8, [ 2, 7, 0 ] ],
  [ 1, Rationals, 12, [ [ 2, 5, 9 ], [ 2, 7, 0 ] ], [ [ 9 ] ] ] ]
gap> WedderburnDecompositionInfo( GroupRing( CF(3), SmallGroup(48,15) ) );
[ [ 1, CF(3) ], [ 1, CF(3) ], [ 1, CF(3) ], [ 1, CF(3) ], [ 2, CF(3) ],
  [ 2, CF(3), 3, [ 1, 1, 0 ] ], [ 2, CF(3) ], [ 2, CF(3) ],
  [ 2, CF(3), 6, [ 1, 1, 0 ] ], [ 1, NF(24,[ 1, 7 ]), 8, [ 2, 7, 0 ] ],
  [ 2, CF(3), 12, [ 2, 7, 0 ] ] ]
]]>
</Example>



In some cases the some of the first entries of the output of <Ref Attr="WedderburnDecompositionInfo" /> 
are not integers and so the <E>Wedderburn components</E> (<Ref Sect="WedDec" />) are given as 
"fractional matrix algebra" of <E>cyclotomic algebras</E> <Ref Sect="Cyclotomic" />. 
See <Ref Sect="WedDec" /> for a theoretical explanation of this phenomenon. In that case a warning message is 
displayed.


<Example>
<![CDATA[
gap> QG:=GroupRing(Rationals,SmallGroup(240,89));
<algebra-with-one over Rationals, with 2 generators>
gap> WedderburnDecompositionInfo(QG);
[ [ 1, Rationals ], [ 1, Rationals ], [ 1, Rationals, 10, [ 4, 3, 5 ] ],
  [ 4, Rationals ], [ 4, Rationals ], [ 5, Rationals ], [ 5, Rationals ],
  [ 6, Rationals ],
  [ 1/2, NF(12,[ 1, 11 ]), 60, [ [ 4, 13, 5 ], [ 2, 11, 0 ] ], [ [ 0 ] ] ],
  [ 3/4, NF(8,[ 1, 7 ]), 40, [ [ 4, 7, 5 ], [ 2, 31, 0 ] ], [ [ 0 ] ] ] ]
]]>
</Example>

The interpretation of the output in the previous example give rise to the following 
<E>Wedderburn decomposition</E> <Ref Sect="WedDec" /> of <M>QG</M> for <M>G</M> the small group <M>[240,89]</M>:
    <Display>
    QG = 2Q \oplus 2 M_4(Q) \oplus 2 M_5(Q) \oplus M_6(Q) \oplus A \oplus B \oplus C
    </Display>
where 
    <Display>
    A = Q(\xi_{10})[u|\xi_{10}^u = \xi^3, u^4 = -1],
    </Display>
<M>B</M> is an algebra of degree <M>(4*2 )/2  = 4 </M> which is <E>Brauer equivalent</E> <Ref Sect="Brauer" /> to 
    <Display>
    B_1 = Q(\xi_{60})[u,v|\xi_{60}^u = \xi^{13}, u^4 = \xi_{60}^5, \xi^v = \xi^{11}, v^2 = 1, vu=uv],
    </Display>
and <M>C</M> is an algebra of degree <M>(4*2)*3/4  = 6 </M> which is <E>Brauer equivalent</E> <Ref Sect="Brauer" /> to 
    <Display>
    C_1 = Q(\xi_{60})[u,v|\xi_{60}^u = \xi^7, u^4 = \xi_{60}^5, \xi^v = \xi^{31}, v^2 = 1, vu=uv].
    </Display>
The precise description of <M>B</M> and <M>C</M> requires the uses of "ad hoc" arguments.

</Section>

<Alt Only="LaTeX">\newpage</Alt> 


<!-- ********************************************************* -->

<Section Label="DecompSimple">
<Heading>Simple quotients</Heading>



<ManSection>
   <Oper Name="SimpleAlgebraByCharacter" 
         Arg="FG chi"  
         Comm="The Wedderburn component of the group algebra FG 
         determined by the irreducible character chi" />
   <Returns>
         A simple algebra.
   </Returns>
   <Description>
        The first input <A>FG</A> should be a <E>semisimple group algebra</E> <Ref Sect="Semisimple" /> 
        over a finite group <M>G</M> and the second input should be an irreducible character of <M>G</M>.<P/>
        
        The output is a matrix algebra of a <E>cyclotomic algebras</E> <Ref Sect="Cyclotomic" /> 
        which is isomorphic to the unique <E>Wedderburn component</E> <Ref Sect="WedDec" /> <M>A</M> 
        of <A>FG</A> such that <M>\chi(A)\ne 0</M>.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> A5 := AlternatingGroup(5);
Alt( [ 1 .. 5 ] )
gap> SimpleAlgebraByCharacter( GroupRing( Rationals , A5 ) , Irr( A5 ) [3] );
( NF(5,[ 1, 4 ])^[ 3, 3 ] )
gap> SimpleAlgebraByCharacter( GroupRing( GF(7) , A5 ) , Irr( A5 ) [3] );
( GF(7^2)^[ 3, 3 ] )
gap> G:=SmallGroup(128,100);
<pc group of size 128 with 7 generators>
gap> SimpleAlgebraByCharacter( GroupRing( Rationals , G ) , Irr(G)[19] );
<crossed product with center NF(8,[ 1, 3 ]) over AsField( NF(8,[ 1, 3 ]), CF(
8) ) of a group of size 2>
]]>
</Example>


<!-- ************************ -->

<ManSection>
   <Oper Name="SimpleAlgebraByCharacterInfo" 
         Arg="QG chi"  
         Comm="The numerical data describing the output of
         SimpleAlgebraByCharacter" />
   <Returns>
         The numerical description of the output of SimpleAlgebraByCharacter
   </Returns>
   <Description>
        The first input <A>FG</A> is a <E>semisimple group algebra</E> <Ref Sect="Semisimple" /> over a finite group 
        <M>G</M> and the second input is an irreducible character of <M>G</M>. <P/>
        
        The output is the numerical description <Ref Sect="NumDesc" /> of a <E>cyclotomic algebras</E> <Ref Sect="Cyclotomic" /> 
        which is isomorphic to the unique <E>Wedderburn component</E> <Ref Sect="WedDec" /> <M>A</M> of <A>FG</A> 
        such that <M>\chi(A)\ne 0</M>. <P/>
        
        See <Ref Sect="NumDesc" /> for 
        the interpretation of the numerical information given by the output.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> G:=SmallGroup(144,11);
<pc group of size 144 with 6 generators>
gap> QG:=GroupRing(Rationals,G);
<algebra-with-one over Rationals, with 6 generators>
gap> SimpleAlgebraByCharacter( QG , Irr(G)[48] );
<crossed product with center NF(36,[ 1, 17 ]) over AsField( NF(36,
[ 1, 17 ]), CF(36) ) of a group of size 2>
gap> SimpleAlgebraByCharacterInfo( QG , Irr(G)[48] );
[ 1, NF(36,[ 1, 17 ]), 36, [ 2, 17, 18 ] ]
]]>
</Example>


<!-- ************************ -->


<ManSection>
   <Oper Name="SimpleAlgebraByStrongSP" 
         Arg="QG K H"  
         Comm="The Wedderburn component of the rational group algebra QG 
         realized by (K,H), a strongly Shoda pair of G" />
   <Oper Name="SimpleAlgebraByStrongSP" 
         Arg="FG K H C"  
         Comm="The Wedderburn component of the semisimple finite group algebra 
         FG given realized by (K,H), a strongly Shoda pair of G, and a 
         q-cyclotomic class" />
   <Oper Name="SimpleAlgebraByStrongSPNC" 
         Arg="QG K H"  
         Comm="Same as the non NC version without checking that (K,H) is a 
         strongly Shoda pair of G" />
   <Oper Name="SimpleAlgebraByStrongSPNC" 
         Arg="FG K H C"  
         Comm="Same as the non NC version without checking that (K,H) is a 
         strongly Shoda pair of G" />
   <Returns>
         A simple algebra
   </Returns>
   <Description>
        In the three-input version the input must be formed by a <E>semisimple rational group algebra</E> 
        <Ref Sect="Semisimple" /> <A>QG</A> and a two subgroups <A>K</A> and <A>H</A> of <M>G</M> 
        which form a <E>strongly Shoda pair</E> <Ref Sect="SSPDef" /> of <M>G</M>. <P/>
        
        Returns the Wedderburn component (<Ref Sect="WedDec" />) of the rational group algebra <A>QG</A> 
        <M>G</M> realized by a the strongly Shoda pair (<A>K</A>,<A>H</A>). <P/>
        
        In the four input version the first input is a semisimple finite group algebra <A>FG</A>,
        <A>(K,H)</A> is a strongly Shoda pair of <M>G</M> and the fourth input data is either 
        a generating <M>q</M>-cyclotomic class module [<A>K</A>,<A>H</A>] or a representative of 
        generating <M>a</M>-cyclotomic class module [<A>K</A>,<A>H</A>] (<Ref Sect="CyclotomicClass" />). <P/> 
        
        Returns the Wedderburn component (<Ref Sect="WedDec" />) of the finite group algebra <A>FG</A> 
        realized by a the strongly Shoda pair (<A>K</A>,<A>H</A>) and the cyclotomic class <A>C</A> 
        (or the cyclotomic class containing <A>C</A>). <P/>

               
         The versions ended in NC does not check if (<A>K</A>,<A>H</A>) is a 
         strongly Shoda pair of <M>G</M> and, in the four-input version, 
         if <A>C</A> is either a generating <M>q</M>-cyclotomic class <A>C</A> 
         modulo <M>[K:H]</M> or an integer coprime with <M>[K:H]</M>.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> F:=FreeGroup("a","b");; a:=F.1;; b:=F.2;;
gap> G:=F/[ a^16, b^2*a^8, b^-1*a*b*a^9 ];; a:=G.1;; b:=G.2;;
gap> K:=Subgroup(G,[a]);; H:=Subgroup(G,[]);;
gap> QG:=GroupRing( Rationals, G );;
gap> FG:=GroupRing( GF(7), G );;
gap> SimpleAlgebraByStrongSP( QG, K, H );
<crossed product over CF(16) of a group of size 2>
gap> SimpleAlgebraByStrongSP( FG, K, H, [1,7] );
( GF(7)^[ 2, 2 ] )
gap> SimpleAlgebraByStrongSP( FG, K, H, 1 );
( GF(7)^[ 2, 2 ] )
]]>
</Example>

<!-- ************************ -->

<ManSection>
   <Oper Name="SimpleAlgebraByStrongSPInfo" 
         Arg="QG K H"  
         Comm="The numerical data describing the output of SimpleAlgebraByStrongSP" />
   <Oper Name="SimpleAlgebraByStrongSPInfo" 
         Arg="FG K H c"  
         Comm="The numerical data describing the output of SimpleAlgebraByStrongSP" />
   <Oper Name="SimpleAlgebraByStrongSPInfoNC" 
         Arg="FG K H c"  
         Comm="The numerical data describing the output of SimpleAlgebraByStrongSPNC" />         
   <Oper Name="SimpleAlgebraByStrongSPInfoNC" 
         Arg="QG K H"  
         Comm="The numerical data describing the output of SimpleAlgebraByStrongSPNC" />
   <Returns>
         numerical description of one simple algebra
   </Returns>
   <Description>
        In the three-input version the input must be formed by a <E>semisimple rational group algebra</E> 
        <Ref Sect="Semisimple" /> <A>QG</A> and a two subgroups <A>K</A> and <A>H</A> of <M>G</M> 
        which form a <E>strongly Shoda pair</E> <Ref Sect="SSPDef" /> of <M>G</M>. <P/>
        
        Returns the numerical information describing the Wedderburn component (<Ref Sect="NumDesc" />) 
        of the rational group algebra <A>QG</A> realized by a the strongly Shoda pair (<A>K</A>,<A>H</A>). <P/>
        
        In the four input version the first input is a semisimple finite group algebra <A>FG</A>,
        <A>(K,H)</A> is a strongly Shoda pair of <M>G</M> and the fourth input data is either 
        a generating <M>q</M>-cyclotomic class module [<A>K</A>,<A>H</A>] or a representative of 
        generating <M>a</M>-cyclotomic class module [<A>K</A>,<A>H</A>] (<Ref Sect="CyclotomicClass" />). <P/> 
        
        Returns a pair of positive integers <M>[n,r]</M> which represent the <M>n\times n</M> matrix algebra over the 
        field of order <M>r</M> which is isomorphic to the Wedderburn component of <A>FG</A> 
        realized by a the strongly Shoda pair (<A>K</A>,<A>H</A>) and the cyclotomic class <A>C</A> 
        (or the cyclotomic class containing <A>C</A>). <P/>

               
         The versions ended in NC does not check if (<A>K</A>,<A>H</A>) is a 
         strongly Shoda pair of <M>G</M> and, in the four-input version, 
         if <A>C</A> is either a generating <M>q</M>-cyclotomic class <A>C</A> 
         modulo <M>[K:H]</M> or an integer coprime with <M>[K:H]</M>.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> F:=FreeGroup("a","b");; a:=F.1;; b:=F.2;;
gap> G:=F/[ a^16, b^2*a^8, b^-1*a*b*a^9 ];; a:=G.1;; b:=G.2;;
gap> K:=Subgroup(G,[a]);; H:=Subgroup(G,[]);; 
gap> QG:=GroupRing( Rationals, G );;
gap> FG:=GroupRing( GF(7), G );;
gap> SimpleAlgebraByStrongSP( QG, K, H );
<crossed product over CF(16) of a group of size 2>
gap> SimpleAlgebraByStrongSPInfo( QG, K, H );
[ 1, NF(16,[ 1, 7 ]), 16, [ [ 2, 7, 8 ] ], [  ] ]
gap> SimpleAlgebraByStrongSPInfo( FG, K, H, [1,7] );
[ 2, 7 ]
gap> SimpleAlgebraByStrongSPInfo( FG, K, H, 1 );
[ 2, 7 ]
]]>
</Example>

</Section>


</Chapter>
