<!-- $Id$ -->

<!-- ********************Introduction******************** -->

<Chapter Label="Intro">
<Heading>Introduction</Heading>    

<Section Label="IntroAims">
<Heading>General aims of &Wedderga; package</Heading>
The title ``&Wedderga;'' stands for ``<B>Wedder</B>burn decomposition of a 
<B>g</B>roup <B>a</B>lgebras. This is a &GAP; package to compute the simple 
components of the Wedderburn decomposition of group algebras of finite 
groups over fields of characteristic zero and over finite fields. 
It also contains functions that produce the primitive central idempotents 
of group algebras of finite groups over the field of rationals and
and over finite fields.<P/>

</Section>

<!-- ********************************************************* -->

<Section Label="IntroMain">
<Heading>Main functions of &Wedderga; package</Heading>

The main functions of &Wedderga; are 
<Ref Attr="WedderburnDecomposition" /> and
<Ref Attr="WedderburnDecompositionInfo" />.
<P/>

In the case when the input <A>FG</A> is a group algebra of a finite
group <M>G</M> over a field <M>F</M> of characteristic zero,
<Ref Attr="WedderburnDecomposition" /> 
computes a list of simple algebras such that their direct product is
isomorphic to the group algebra <M>FG</M>, thus, the output is
the complete Wedderburn decomposition of <A>FG</A>. <P/>

In the case when the input <A>FG</A> is a group algebra of a finite
group <M>G</M> over a field <M>F</M> of characteristic <M>q</M>
coprime with the order of <M>G</M>, <Ref Attr="WedderburnDecomposition" /> 
computes a list of simple algebras such that their direct product is 
isomorphic to certain direct factor of the group algebra <A>FG</A>
(if this is a proper direct factor, a warning will be displayed). 
If the group <M>G</M> satisfies some additional conditions, 
the direct product of simple algebras from the output will 
be isomorphic to the whole group algebra <A>FG</A>, so in this 
case the output is the complete Wedderburn decomposition of <A>FG</A>. 
For example, this is the case if <M>G</M> is abelian by supersolvable.
(see Chapter <Ref Chap="Theory" /> for theoretical background). <P/>  

When <M>F</M> is a field of characteristic zero,
the entries of the output are given as matrix algebras over some 
crossed products over certain cyclotomic extensions of the field <M>F</M>. 
These crossed products are in fact cyclotomic algebras 
(see <Ref Sect="Cyclotomic" />), thus, the entries of the output of 
<Ref Attr="WedderburnDecomposition" /> 
are realizations of the Wedderburn components of <A>FG</A> as algebras similar 
to cyclotomic algebras. Recall that the Brauer-Witt Theorem ensures 
that every simple factor of a semisimple group ring <M>FG</M> is similar 
(that is represents the same class in the Brauer group of its centre) 
to a cyclotomic algebra (<Cite Key="BR"/>, <Cite Key="Olteanu" />). 
<P/>

When <M>F</M> is a finite field,
the simple factors of <A>FG</A> are also matrix algebras over division rings 
which are finite extensions of the field <M>F</M>.
If <M>F</M> is finite then by the Wedderburn theorem these division rings 
are finite fields. In this case the the output of 
<Ref Attr="WedderburnDecomposition" />
represents the factors of <A>FG</A> as matrix algebras over finite extensions
of the field <M>F</M>.
<P/>

<Example>
<![CDATA[
gap> QG := GroupRing( Rationals, SymmetricGroup(4) );
<algebra-with-one over Rationals, with 2 generators>
gap> WedderburnDecomposition( QG );
[ Rationals, Rationals, ( Rationals^[ 3, 3 ] ), ( Rationals^[ 3, 3 ] ), 
  <crossed product over CF(3), with 2 generators and center=Rationals> ]
gap> FG := GroupRing( CF(5), SymmetricGroup(4) );
<algebra-with-one over CF(5), with 2 generators>
gap> WedderburnDecomposition( FG );
[ CF(5), CF(5), ( CF(5)^[ 3, 3 ] ), ( CF(5)^[ 3, 3 ] ), 
  <crossed product over AsField( CF(5), CF(15) ), 
    with 2 generators and center=CF(5)> ]
gap> FG := GroupRing( GF(5), SymmetricGroup(4) ); 
<algebra-with-one over GF(5), with 2 generators>
gap> WedderburnDecomposition( FG );
[ ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 1, 1 ] ), ( GF(5)^[ 2, 2 ] ), 
  ( GF(5)^[ 3, 3 ] ), ( GF(5)^[ 3, 3 ] ) ]
gap> FG := GroupRing( GF(5), SmallGroup(24,3) );
<algebra-with-one over GF(5), with 4 generators>
gap> WedderburnDecomposition( FG );
[ ( GF(5)^[ 1, 1 ] ), ( GF(5^2)^[ 1, 1 ] ), ( GF(5)^[ 2, 2 ] ), 
  ( GF(5^2)^[ 2, 2 ] ), ( GF(5)^[ 3, 3 ] ) ]
]]>
</Example>

Instead of <Ref Attr="WedderburnDecompositionInfo" />, that returns a list of 
&GAP; objects, <Ref Attr="WedderburnDecompositionInfo" /> returns the numerical 
description of these objects. 
See Chapter <Ref Sect="SSPDef" /> for theoretical background.

</Section>

<!-- ********************************************************* -->

<Section Label="IntroInstall">
<Heading>Installation and system requirements</Heading>

&Wedderga; does not use external binaries and, therefore, works without
restrictions on the type of the operation system. It is designed for &GAP;4.4  
and no compatibility with previous releases of &GAP;4 is guaranteed. 
<P/>

To use the &Wedderga; online help it is necessary to install the &GAP;4 package 
&GAPDoc; by Frank L\"ubeck and Max Neunh\"offer, which is available from the 
&GAP; site or from 
<URL>http://www.math.rwth-aachen.de/~Frank.Luebeck/GAPDoc/</URL>.
<P/> 

&Wedderga; is distributed in standard formats
(<File>zoo</File>, <File>tar.gz</File>, <File>tar.bz2</File>, 
<File>-win.zip</File>) and can be obtained from 
<URL>http://ukrgap.exponenta.ru/wedderga.htm</URL>.
To unpack the archive <File>wedderga-4.0.zoo</File> you need the program 
<File>unzoo</File>, which can be obtained from the &GAP; homepage 
<URL>http://www.gap-system.org/</URL> (see section `Distribution').
To install &Wedderga;, copy this archive into the <File>pkg</File> subdirectory of your 
&GAP;4.4 installation. The subdirectory <File>wedderga</File> will be created in 
the <File>pkg</File> directory after the following command:
<P/>
  <C>unzoo -x wedderga-4.0.zoo</C>
<P/>

</Section>

</Chapter>