<!-- $Id$ -->

<!-- ********************SSP******************** -->

<Chapter Label="SSP">
<Heading>Strongly Shoda pairs</Heading>

<Section Label="SSPSSP">
<Heading>Computing strongly Shoda pairs</Heading>

<ManSection>
   <Attr Name="StronglyShodaPairs" 
         Arg="G"  
         Comm="A list of SSPs representatives realizing Wedderburn components of QG" />
   <Returns>
         A list of pairs of subgroups of the input group
   </Returns>
   <Description>
        Computes a list <M>ssp</M> of representatives of the equivalence classes of strongly Shoda pairs 
        of the finite group <A>G</A> (see <Ref Sect="SSPDef" />). <P/>
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> StronglyShodaPairs( SymmetricGroup(4) );
[ [ Sym( [ 1 .. 4 ] ), Group([ (1,4)(2,3), (1,3)(2,4), (2,4,3), (3,4) ]) ],
  [ Sym( [ 1 .. 4 ] ), Group([ (1,4)(2,3), (1,3)(2,4), (2,4,3) ]) ],
  [ Group([ (3,4), (1,3,2,4) ]), Group([ (1,3,2,4), (1,2)(3,4) ]) ],
  [ Group([ (1,3,2,4), (3,4) ]), Group([ (3,4), (1,2)(3,4) ]) ],
  [ Group([ (2,4,3), (1,4)(2,3) ]), Group([ (1,4)(2,3), (1,3)(2,4) ]) ] ]
gap> StronglyShodaPairs( DihedralGroup(64) );
[ [ <pc group of size 64 with 6 generators>, Group([ f6, f5, f4, f3, f1, f2 ]) ], 
  [ <pc group of size 64 with 6 generators>, Group([ f6, f5, f4, f3, f1*f2 ]) ], 
  [ <pc group of size 64 with 6 generators>, Group([ f6, f5, f4, f3, f2 ]) ], 
  [ <pc group of size 64 with 6 generators>, Group([ f6, f5, f4, f3, f1 ]) ], 
  [ Group([ f1*f2, f4*f5*f6, f5*f6, f6, f3, f3 ]), Group([ f6, f5, f4, f1*f2 ]) ], 
  [ Group([ f6, f5, f2, f3, f4 ]), Group([ f6, f5 ]) ], 
  [ Group([ f6, f2, f3, f4, f5 ]), Group([ f6 ]) ], 
  [ Group([ f2, f3, f4, f5, f6 ]), Group([  ]) ] ]]]>
</Example>

</Section>

<Section Label="IsSSP">
<Heading>Properties related with Shoda pairs</Heading>

<ManSection>
   <Oper Name="IsStronglyShodaPair" 
         Arg="G K H"  
         Comm="Is (K,H) a strongly Shoda pair of G?" />
   <Description>
         Returns <K>true</K> if (<A>K</A>,<A>H</A>)
         is a strongly Shoda pair of the group <A>G</A>,
         and <K>false</K> otherwise (see <Ref Sect="SSPDef" />
         for the definition).
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> G:=SymmetricGroup(3);; K:=Group([(1,2,3)]);; H:=Group( () );;
gap> IsStronglyShodaPair( G, K, H );
true
gap> IsStronglyShodaPair( G, G, H );
false
gap> IsStronglyShodaPair( G, K, K );
false
gap> IsStronglyShodaPair( G, G, K );
true
]]>
</Example>


<ManSection>
   <Oper Name="IsShodaPair" 
         Arg="G K H"  
         Comm="Is (K,H) a Shoda pair of G?" />
   <Description>
        Returns <K>true</K> if (<A>K</A>,<A>H</A>) is a Shoda pair of 
        the group <A>G</A>, and <K>false</K> otherwise 
        (see <Ref Sect="SPDef" /> for the definition).
        Note that every strongly Shoda pair is a Shoda pair,
        but the converse is not true.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> G:=AlternatingGroup(5);;
gap> K:=AlternatingGroup(4);;
gap> H := Group( (1,2)(3,4), (1,3)(2,4) );;
gap> IsStronglyShodaPair( G, K, H );
false
gap> IsShodaPair( G, K, H );
true
]]>
</Example>


<ManSection>
   <Oper Name="IsStronglyMonomial" 
         Arg="G"  
         Comm="Is every Wedderburn component realizable by a SSP" />
   <Description>
        Returns <K>true</K> if the finite group <A>G</A> is strongly 
        monomial, that is if every Wedderburn component of the rational 
        group algebra is realizable by a strongly Shoda pair 
        (see <Ref Sect="SSPDef" />).
        In this case also every Wedderburn component of a semisimple 
        finite group algebra over <A>G</A> is also realizable by a 
        strongly Shoda pair together with a cyclotomic class 
        (see <Ref Sect="CyclotomicClass" />).<P/>
        Note that every strongly monomial finite group is monomial, and
        every abelian-by-supersolvable or metabelian finite group is 
        strongly monomial. Also every monomial group of order less than 
        1000 is strongly monomial, but not every monomial group is strongly monomial.
   </Description>
</ManSection>

<Example>
<![CDATA[
gap> S4:=SymmetricGroup(4);;
gap> IsStronglyMonomial(S4);
true
gap> G:=SmallGroup(24,3);;
gap> IsStronglyMonomial(G);
false
gap> IsMonomial(G);
false
gap> G:=SmallGroup(1000,86);;
gap> IsMonomial(G);
true
gap> IsStronglyMonomial(G);
false
]]>
</Example>


</Section>

</Chapter>
